uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальныйШаблон</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерии</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЗабалансовыеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьАналитическиеРаскрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьГруппирующиеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьБухгалтерскиеИтогиПоГруппирующимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРакурсы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоСтруктуреСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожетИспользоватьсяДляУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДляСогласованияЗначений</name>
    <type>
      <types>EnumRef.ОбъектыСогласованияЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВыбраннымСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаФормированияФормул</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулыДляНачальныхСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВидыИтоговПоСчетам</name>
    <attributes>
      <name>ВидИтогаПоСчету</name>
      <type>
        <types>EnumRef.ВидыБухгалтерскихИтогов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <attributes>
      <name>КолонкаОтчета</name>
      <comment>ОПК</comment>
      <type>
        <types>CatalogRef.КолонкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предназначение</name>
      <comment>ОПК</comment>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеСчета</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетИспользуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/ОбщегоНазначенияПовтИспУХ/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьДополнительныеЯзыки() Экспорт
	Возврат Константы.ДополнительныеЯзыкиВыводаОтчета.Получить().Получить();
КонецФункции

Функция РассчитыватьРасхожденияПорталаВГО() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.Константы.Найти("РассчитыватьРасхожденияВГО") = Неопределено Тогда
		Возврат Ложь;//БМ, НМ
	КонецЕсли;
	
	ИмяКонстанты = "РассчитыватьРасхожденияВГО";
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

// Возвращает валюту регламентированного учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту рег. учета. Если валюта рег. учета не заполнена - возвращает пустую ссылку на валюту.
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить.
//
// Возвращаемое значение:
// СправочникСсылка.Валюты.
//
Функция ПолучитьВалютуРегламентированногоУчета() Экспорт
	
	Если ЕстьРСБУ() Тогда
		Возврат Константы["ВалютаРегламентированногоУчета"].Получить();		
	Иначе 
		Возврат ПолучитьВалютуУправленческогоУчета();
	КонецЕсли;
	
КонецФункции

// Возвращает валюту управленческого учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту упр. учета. Если валюта упр. учета не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
// СправочникСсылка.Валюты
//
Функция ПолучитьВалютуУправленческогоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции 

Функция ЕстьРСБУ() Экспорт
	Возврат Метаданные.ПланыСчетов.Найти("Хозрасчетный") <> Неопределено;
КонецФункции

Функция СтранаПоУмолчанию() Экспорт

	Если ЕстьРСБУ() Тогда
		Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтраныМира.Россия");
	КонецЕсли;	

	Возврат ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");//по пользователю	
	
КонецФункции

Функция СценарийКИК() Экспорт

	Если Метаданные.Константы.Найти("СценарийОтчетностиКИК") = Неопределено Тогда
		Возврат Константы.СценарийМСФО.Получить();
	Иначе 
		Возврат Константы["СценарийОтчетностиКИК"].Получить();
	КонецЕсли;

КонецФункции

Функция ПолучитьОсновнойЯзыкПользователя(Пользователь = Неопределено) Экспорт

	Возврат ОбщегоНазначенияУХ.ПолучитьЗначениеПоУмолчанию("ОсновнойЯзык",Пользователь);
	
КонецФункции

// Возвращает статус согласования, присвоенный объекту ОбъектСогласования.
Функция ПолучитьСостояниеСогласованияПоСсылке_Утвержден(ОбъектСогласования) Экспорт
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДействияСогласованиеУХСервер");
		Возврат Модуль.ПолучитьСостояниеСогласования_Утвержден(ТипЗнч(ОбъектСогласования));
	КонецЕсли;
КонецФункции

// Функция возвращает имя реквизита статьи бюджета, которое определяет по виду бюджета, переданному в параметре функции.
//
// Параметры:
//  ВидБюджета - ПеречислениеСсылка.ПредназначенияЭлементовСтруктурыОтчета - Вид бюджета, для которого необходимо получить название реквизита Статья.
// 
// Возвращаемое значение: 
//	- Строка
//
Функция ПолучитьИмяРеквизитаСтатьяБюджета(ВидБюджета) Экспорт

	Если ВидБюджета = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств Тогда
		Возврат "СтатьяДвиженияДенежныхСредств";
	ИначеЕсли ВидБюджета = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов Тогда
		Возврат "СтатьяДоходовИРасходов";
	КонецЕсли;
	
	Возврат "СтатьяБюджета";
	
КонецФункции // ПолучитьИмяРеквизитаСтатьяБюджета()

// Возвращает значение константы с именем ИмяКонстантыВход.
Функция ПолучитьЗначениеКонстанты(ИмяКонстантыВход) Экспорт
	РезультатФункции = Константы[ИмяКонстантыВход].Получить();
	Возврат РезультатФункции;
КонецФункции		// ПолучитьЗначениеКонстанты()

// Возвращает ссылку на элем ент справочника ДокументыБД, с наименованием НаименованиеДокументаВход.
Функция ПолучитьДокументБдТекущейБазы(НаименованиеДокументаВход) Экспорт
	РезультатФункции = Справочники.ДокументыБД.ПустаяСсылка();
	ТекИБ = Справочники.ТипыБазДанных.ТекущаяИБ;
	РезультатФункции = Справочники.ДокументыБД.НайтиПоНаименованию(НаименованиеДокументаВход, , , ТекИБ);
	Возврат РезультатФункции;
КонецФункции		// ПолучитьДокументБдТекущейБазы()

// Возвращает ссылку на элем ент справочника СправочникиБД, с наименованием НаименованиеДокументаВход.
Функция ПолучитьСправочникБдТекущейБазы(НаименованиеДокументаВход) Экспорт
	РезультатФункции = Справочники.СправочникиБД.ПустаяСсылка();
	ТекИБ = Справочники.ТипыБазДанных.ТекущаяИБ;
	РезультатФункции = Справочники.СправочникиБД.НайтиПоНаименованию(НаименованиеДокументаВход, , , ТекИБ);
	Возврат РезультатФункции;
КонецФункции		// ПолучитьСправочникБдТекущейБазы()

Функция ЧислоДопАналитик() Экспорт

	Возврат ПараметрыСеанса.ЧислоДопАналитик;

КонецФункции

Функция ЭтоИностранныйНалоговыйРезидент(Организация) Экспорт
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИностранныйНалоговыйРезидент");
КонецФункции // ()

Функция ПраваДоступаБюджетирование() Экспорт
	
	ПраваДоступа = Новый Структура;
	ПраваДоступа.Вставить("НастраиваемыйОтчет_Изменение",			Ложь);
	ПраваДоступа.Вставить("УправлениеПериодомСценария_Изменение",	Ложь);
	
	ПраваДоступа.Вставить("БланкиОтчетов_Изменение",				Ложь);
	
	ПраваДоступа.Вставить("ОписаниеВерсий_Удаление",				Ложь);
	
	ПраваДоступа.Вставить("ПериодическиеКурсы_Изменение",			Ложь);
	
	Если НЕ ИспользуетсяМногопериоднаяОтчетность() Тогда
		Возврат ПраваДоступа;
	КонецЕсли;
	
	ПраваДоступа.Вставить("НастраиваемыйОтчет_Изменение",			ПравоДоступа("Изменение", Метаданные.Документы.НастраиваемыйОтчет));
	ПраваДоступа.Вставить("УправлениеПериодомСценария_Изменение",	ПравоДоступа("Изменение", Метаданные.Документы.УправлениеПериодомСценария));
	
	ПраваДоступа.Вставить("БланкиОтчетов_Изменение",				ПравоДоступа("Изменение", Метаданные.Справочники.БланкиОтчетов));
	
	ПраваДоступа.Вставить("ОписаниеВерсий_Удаление",				ПравоДоступа("Удаление", Метаданные.Справочники.ОписаниеВерсий));
	
	ПраваДоступа.Вставить("ПериодическиеКурсы_Изменение",			ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПериодическиеКурсы));

	Возврат ПраваДоступа;
	
КонецФункции

Функция ИспользуетсяМногопериоднаяОтчетность() Экспорт

	Возврат ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.МногопериоднаяОтчетность");

КонецФункции

// Возвращает данные вида отчета
//
// Параметры:
//  ВидОтчета	 - СправочникСсылка.ВидыОтчетов - Ссылка на вид отчета
// 
// Возвращаемое значение:
//   - Структура - Структура с данными вида отчета
//
Функция ДанныеВидаОтчета(ВидОтчета) Экспорт
	
	ДанныеВидаОтчета = Новый Структура;
	ДанныеВидаОтчета.Вставить("ВидОтчета", Справочники.ВидыОтчетов.ПустаяСсылка());
	ДанныеВидаОтчета.Вставить("РазделениеПоПроектам", Ложь);
	ДанныеВидаОтчета.Вставить("СохранятьИсториюИзменений", Ложь);
	ДанныеВидаОтчета.Вставить("МаксКлючевыхАналитик", 0);
	Для Сч = 1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		ДанныеВидаОтчета.Вставить("ВидАналитики" + Сч, Неопределено);
		ДанныеВидаОтчета.Вставить("ТипЗначенияАналитики" + Сч, Неопределено);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ВидОтчета) Тогда
		Возврат ДанныеВидаОтчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыОтчетов.Ссылка КАК ВидОтчета,
		|	ВидыОтчетов.РазделениеПоПроектам КАК РазделениеПоПроектам,
		|	ВидыОтчетов.СохранятьИсториюИзменений КАК СохранятьИсториюИзменений,
		|	ВидыОтчетов.КоличествоАналитик КАК МаксКлючевыхАналитик,
		|	ВидыОтчетов.ВидАналитики1 КАК ВидАналитики1,
		|	ВидыОтчетов.ВидАналитики2 КАК ВидАналитики2,
		|	ВидыОтчетов.ВидАналитики3 КАК ВидАналитики3,
		|	ВидыОтчетов.ВидАналитики4 КАК ВидАналитики4,
		|	ВидыОтчетов.ВидАналитики5 КАК ВидАналитики5,
		|	ВидыОтчетов.ВидАналитики6 КАК ВидАналитики6,
		|	ВидыОтчетов.ВидАналитики1.ТипЗначения КАК ТипЗначенияАналитики1,
		|	ВидыОтчетов.ВидАналитики2.ТипЗначения КАК ТипЗначенияАналитики2,
		|	ВидыОтчетов.ВидАналитики3.ТипЗначения КАК ТипЗначенияАналитики3,
		|	ВидыОтчетов.ВидАналитики4.ТипЗначения КАК ТипЗначенияАналитики4,
		|	ВидыОтчетов.ВидАналитики5.ТипЗначения КАК ТипЗначенияАналитики5,
		|	ВидыОтчетов.ВидАналитики6.ТипЗначения КАК ТипЗначенияАналитики6
		|ИЗ
		|	Справочник.ВидыОтчетов КАК ВидыОтчетов
		|ГДЕ
		|	ВидыОтчетов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидОтчета);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеВидаОтчета, Выборка);
	КонецЕсли;
	
	Возврат ДанныеВидаОтчета;

КонецФункции

#КонецОбласти
